Repository: threadi/external-files-in-media-library
Catalog: languages/external-files-*-media-library-*.po
Languages: de_de

source: Directory could not be loaded.
de_de: Verzeichnis konnte nicht geladen werden.

source: Please wait, list is loading.
de_de: Bitte warten, Liste lädt.

source: Your directory archive
de_de: Dein Verzeichnisarchiv

source: SFTP-URL is not readable.
de_de: SFTP-URL ist nicht lesbar.

source: FTP-URL is not readable.
de_de: FTP-URL ist nicht lesbar.

source: The given URL is not compatible with the protocol %1$s. Further tests for other protocols will follow.
de_de: Die angegebene URL ist nicht kompatibel mit dem Protokoll %1$s. Weitere Tests für andere Protokolle werden folgen.

source: The protocol %1$s is not usable in this hosting.
de_de: Das Protokoll %1$s ist in diesem Hosting nicht verwendbar.

source: Protocol %1$s is not a Protocol_Base object.
de_de: Protokoll %1$s ist kein Protocol_Base-Objekt.

source: Protocol %1$s does not exist as object.
de_de: Das Protokoll %1$s existiert nicht als Objekt.

source: Use below credentials to import these URLs
de_de: Verwende die folgenden Anmeldeinformationen, um diese URLs zu importieren

source: Use below credentials to import the URL
de_de: Verwende die folgenden Anmeldeinformationen, um die URL zu importieren

source: Import has been executed
de_de: Der Import wurde ausgeführt

source: The following error has occurred:
de_de: Der folgende Fehler ist aufgetreten:

source: Generated new thumb for %1$s
de_de: Neues Vorschaubild für %1$s generiert

source: Loading thumb from cache for %1$s
de_de: Lade Vorschaubild aus dem Cache für %1$s

source: Error during switch to local hosting.
de_de: Fehler beim Wechsel zum lokalen Hosting.

source: Error during switch to external hosting.
de_de: Fehler beim Wechsel zum externen Hosting.

source: Proxy is disabled for this file type.
de_de: Proxy ist für diesen Dateityp deaktiviert.

source: Using following settings to save this URL:
de_de: Verwende die folgenden Einstellungen, um diese URL zu speichern:

source: If this option is enabled all external files will be saved in media library with the date set by the external location. If the external location does not set any date the actual date will be used.
de_de: Wenn diese Option aktiviert ist, werden alle externen Dateien in der Mediathek mit dem vom externen Speicherort festgelegten Datum gespeichert. Wenn der externe Speicherort kein Datum festlegt, wird das aktuelle Datum verwendet.

source: Use external file dates
de_de: Verwende externe Datei-Datumsangaben

source: Given file already exist in media library.
de_de: Die angegebene Datei existiert bereits in der Mediathek.

source: Files with credentials are saved locally.
de_de: Dateien mit Zugangsdaten werden lokal gespeichert.

source: If enabled any external hosted images during CSV-import will be handled as external files by this plugin.
de_de: Wenn diese Option aktiviert ist, werden alle extern gehosteten Bilder während des CSV-Imports von diesem Plugin als externe Dateien behandelt.

source: Enable support for WooCommerce
de_de: Aktiviere Unterstützung für WooCommerce

source: This is handled by Rank Math.
de_de: Das wird durch Rank Math übernommen.

source: Given GoogleDrive-URL could not be used as external file in websites.
de_de: Die angegebene GoogleDrive-URL kann nicht als externe, eingebettete Datei in Websites verwendet werden.

source: Migrate now
de_de: Jetzt migrieren

source: <strong>We detected that you are using Exmage - great!</strong> Click on the following button to migrate the Exmage-files.
de_de: <strong>Wir haben festgestellt, dass du Exmage verwendest - großartig!</strong> Klicke auf den folgenden Button, um die Exmage-Dateien zu migrieren.

source: Yes, migrate
de_de: Ja, migrieren

source: Hint: create a backup before you run this migration.
de_de: Tipp: Erstelle eine Sicherung, bevor du diese Migration durchführst.

source: After the migration you will not be able to use the Exmage functions on your files. But you could use the features of External Files for Media Library.
de_de: Nach der Migration kannst du die Exmage-Funktionen für deine Dateien nicht mehr verwenden. Du kannst aber die Funktionen von Externen Dateien in der Mediathek nutzen.

source: Are you sure you want to migrate your files?
de_de: Möchtest du die Dateien wirklich migrieren?

source: Migrate from Exmage to External Files for Media Library
de_de: Migriere von Exmage zu Externe Dateien in der Mediathek

source: Process entry
de_de: Verarbeite Eintrag

source: The URL will be imported as external file. You may be want to import this URL through the automatic import of the queue.
de_de: Die URL wird als externe Datei importiert. Möglicherweise möchtest du diese URL über den automatischen Import der Warteschlange importieren.

source: Are you sure you want to process this queue entry now?
de_de: Bist du sicher, dass du diesen Eintrag in der Warteschlange jetzt verarbeiten lassen willst?

source: Process queue entry
de_de: Verarbeite Eintrag der Warteschlange

source: The URL will not be imported. You can add the URL any time again.
de_de: Die URL wird nicht importiert. Du kannst die URL jederzeit wieder hinzufügen.

source: Are you sure you want to delete this queue entry?
de_de: Bist Du sicher, dass du diesen Eintrag in der Warteschlange löschen möchtest?

source: Delete queue entry
de_de: Lösche Eintrag in Warteschlange

source: Will be processed
de_de: Wird verarbeitet

source: No entries in queue found.
de_de: Keine Einträge in Warteschlange gefunden.

source: Delete error entries
de_de: Lösche Einträge zu Fehlern

source: Yes, delete them
de_de: Ja, lösche sie

source: Every entry with state "error" in the queue will be deleted.
de_de: Jeder Eintrag mit dem Status "Fehler" in der Warteschlange wird gelöscht.

source: Are you sure you want to delete error entries in the queue now?
de_de: Bist Du sicher, dass du die Fehlereinträge in der Warteschlange jetzt löschen willst?

source: Delete error entries in the queue now
de_de: Fehlereinträge in der Warteschlange jetzt löschen

source: Clear queue
de_de: Warteschlange leeren

source: Yes, clear the queue
de_de: Ja, lösche die Warteschlange

source: Every entry in the queue will be deleted.
de_de: Jeder Eintrag in der Warteschlange wird gelöscht.

source: Are you sure you want to clear the queue now?
de_de: Bist Du sicher, dass du die Warteschlange jetzt leeren willst?

source: Clear the queue now
de_de: Leere die Warteschlange jetzt

source: Process queue
de_de: Verarbeite Warteschlange

source: Yes, process the queue
de_de: Ja, verarbeite die Warteschlange

source: This might take some time. You have to be patient.
de_de: Das könnte einige Zeit in Anspruch nehmen. Bitte sei geduldig.

source: Only max. %1$d entries will be processed according <a href="%2$s">to your setting</a>.
de_de: Es werden nur max. %1$d Einträge entsprechend <a href="%2$s">deiner Einstellung</a> verarbeitet.

source: Are you sure you want to process the queue now?
de_de: Bist Du sicher, dass du die Warteschlange jetzt bearbeiten willst?

source: Process the queue now
de_de: Verarbeite Warteschlange jetzt

source: Delete entry
de_de: Lösche Eintrag

source: No
de_de: Nein

source: Yes
de_de: ﻿Ja

source: Are you sure you want to delete this log entry?
de_de: Bist Du sicher, dass du diesen Protokolleintrag löschen willst?

source: Delete log entry
de_de: Lösche Protokolleintrag

source: Copy this entry in your clipboard
de_de: Kopiere diesen Eintrag in die Zwischenablage

source: Copied
de_de: Kopiert

source: Errors
de_de: Fehler

source: All
de_de: Alle

source: Info
de_de: Information

source: Success
de_de: Erfolgreich

source: Error
de_de: Fehler

source: No log entries found.
de_de: Keine Protokolleinträge gefunden.

source: Empty the log
de_de: Leere das Protokoll

source: Yes, empty the log
de_de: Ja, leere das Protokoll

source: You will loose any log until now.
de_de: Du wirst alle Protokolleinträge bis jetzt verlieren.

source: Are you sure you want to empty the log?
de_de: Bist Du sicher, dass du das Protokoll leeren willst?

source: Empty log entries
de_de: Lösche Protokolleinträge

source: Log
de_de: Protokoll

source: Date
de_de: Datum

source: Options
de_de: Optionen

source: The statistics has been reset.
de_de: Die Statistik wurde zurückgesetzt.

source: <strong>The statistics has been reset.</strong> No files have been found.
de_de: <strong>Die Statistik wurde zurückgesetzt.</strong> Es wurden keine Dateien gefunden.

source: Click on the button below to reset the file statistics for external files.
de_de: Klicke auf den Button unten, um die Dateistatistiken für externe Dateien zurückzusetzen.

source: Reset file statistics
de_de: Dateistatistiken zurücksetzen

source: The value is in bytes.
de_de: Der Wert ist in Bytes.

source: External file sizes
de_de: Größe der externen Dateien

source: External file counter
de_de: Zähler für externe Dateien

source: Files
de_de: Dateien

source: Statistics
de_de: Statistiken

source: The new settings are now active. Click on the button below to reload the page and see the settings.
de_de: Die neuen Einstellungen sind nun aktiv. Klicke auf den Button unten, um die Seite neu zu laden und die Einstellungen zu sehen.

source: Import has been run successfully.
de_de: Import wurde erfolgreich durchgeführt.

source: Settings have been imported
de_de: Einstellungen wurden importiert.

source: The uploaded file is not a valid JSON-file with settings for this plugin.
de_de: Die hochgeladene Datei ist keine gültige JSON-Datei mit Einstellungen für dieses Plugin.

source: The uploaded file could not be saved. Contact your hoster about this problem.
de_de: Die hochgeladene Datei konnte nicht gespeichert werden. Kontaktiere deinen Hoster zu diesem Problem.

source: The uploaded file does not have the file extension <i>.json</i>.
de_de: Die hochgeladene Datei hat nicht die Datei-Endung <i>.json</i>.

source: The uploaded file is not a valid JSON-file.
de_de: Die hochgeladene Datei ist keine gültige JSON-Datei.

source: The uploaded file is no size.
de_de: Die hochgeladene Datei hat keine Größe.

source: No file was uploaded.
de_de: Keine Datei hochgeladen.

source: The file could not be imported!
de_de: Die Datei konnte nicht importiert werden!

source: Error during import
de_de: Fehler beim Import

source: Import now
de_de: Jetzt importieren

source: Click on the button below to chose your JSON-file with the settings.
de_de: Klicke auf den Button unten, um deine JSON-Datei mit den Einstellungen auszuwählen.

source: Import plugin settings
de_de: Plugin-Einstellungen importieren

source: Required file missing
de_de: Erforderliche Datei fehlt

source: Export now
de_de: Jetzt exportieren

source: Click on the button below to export the actual settings.
de_de: Klicke auf den Button unten, um die aktuellen Einstellungen zu exportieren.

source: Export plugin settings
de_de: Plugin-Einstellungen exportieren

source: External Media Files Settings
de_de: Einstellungen für Externe Dateien in der Mediathek

source: You can adjust the behavior of the plugin to your own requirements in many places via <a href="%1$s">the settings</a>. The possible settings are described in more detail below.
de_de: Du kannst das Verhalten des Plugins an vielen Stellen über <a href="%1$s">die Einstellungen</a> an deine eigenen Bedürfnisse anpassen. Die möglichen Einstellungen werden im Folgenden näher beschrieben.

source: Settings for External Files in Media Library
de_de: Einstellungen für Externe Dateien in der Mediathek

source: These settings only apply to files that are provided via http. Files from other protocols (such as FTP) are generally only saved locally without a proxy.
de_de: Diese Einstellungen gelten nur für Dateien, die über http bereitgestellt werden. Dateien aus anderen Protokollen (z. B. ftp) werden in der Regel nur lokal ohne Proxy gespeichert.

source: Reset now
de_de: Jetzt zurücksetzen

source: Click on the following button to reset the proxy cache.
de_de: Klicke auf den folgenden Button, um den Proxy-Cache zurückzusetzen.

source: Reset proxy cache
de_de: Proxy Cache zurücksetzen

source: This is the path on the filesystem of your WordPress relativ to the <i>wp-content</i> directory. If you change it, the new directory should not exist. All cached files will be copied to the new path.
de_de: Dies ist der Pfad im Dateisystem deines WordPress relativ zum <i>wp-content</i> Verzeichnis. Wenn du ihn änderst, sollte das neue Verzeichnis nicht existieren. Alle zwischengespeicherten Dateien werden kopiert.

source: Proxy path
de_de: Pfad zum Proxy

source: If disabled we will not warn you about the GPRD regulations regarding external files in websites.
de_de: Wenn das Häkchen gesetzt ist, wirst du nicht auf die DSGVO-Vorschriften für externe Dateien auf Websites hingewiesen.

source: Disable GPRD-hint
de_de: Deaktiviere DSGVO-Hinweis

source: Export & Import settings
de_de: Export & Import Einstellungen

source: If enabled after every URL during import the max execution of the PHP-processes is checked regarding the PHP-<i>max_execution_time</i>-setting in your hosting.
de_de: Wenn aktiviert, wird beim Import nach jeder URL die maximale Ausführungszeit der PHP-Prozesse anhand der PHP-<i>max_execution_time</i>-Einstellung in deinem Hosting überprüft.

source: Enable max execution check
de_de: Aktiviere Prüfung der maximalen Ausführzeit

source: Defines how long videos, which are loaded via our own proxy, are saved locally. After this time their cache will be renewed.
de_de: Legt fest, wie lange Videos, die über unseren eigenen Proxy geladen werden, lokal gespeichert werden. Nach dieser Zeit wird ihr Cache erneuert.

source: Max age for cached video in proxy in hours
de_de: Maximales Alter für zwischengespeicherte Videos im Proxy in Stunden

source: This option is only available if videos are hosted external. If this option is disabled, external videos will be embedded with their external URL. To prevent privacy protection issue you could enable this option to load the videos locally.
de_de: Diese Option ist nur verfügbar, wenn die Videos extern gehostet werden. Wenn diese Option deaktiviert ist, werden die externen Videos mit ihrer externen URL eingebettet. Um Probleme mit dem Datenschutz zu vermeiden, kannst du diese Option aktivieren, um die Videos lokal zu laden.

source: Enable proxy for videos
de_de: Aktiviere Proxy für Videos

source: Defines how external video are handled.
de_de: Legt fest, wie externe Videos behandelt werden.

source: Mode for video handling
de_de: Modus für Video-Bearbeitung

source: Defines the maximum timeout for any external request for files.
de_de: Legt die maximale Zeitüberschreitung für alle externen Dateianfragen fest.

source: Max. Timeout in seconds
de_de: Max. Zeitüberschreitung in Sekunden

source: Defines how long audios, which are loaded via our own proxy, are saved locally. After this time their cache will be renewed.
de_de: Legt fest, wie lange Audios, die über unseren eigenen Proxy geladen werden, lokal gespeichert werden. Nach dieser Zeit wird ihr Cache erneuert.

source: Max age for cached audio in proxy in hours
de_de: Höchstalter für zwischengespeicherte Audiodateien im Proxy in Stunden

source: This option is only available if audios are hosted external. If this option is disabled, external audios will be embedded with their external URL. To prevent privacy protection issue you could enable this option to load the audios locally.
de_de: Diese Option ist nur verfügbar, wenn die Audios extern gehostet werden. Wenn diese Option deaktiviert ist, werden externe Audios mit ihrer externen URL eingebettet. Um Probleme mit dem Datenschutz zu vermeiden, kannst du diese Option aktivieren, um die Audios lokal zu laden.

source: Enable proxy for audios
de_de: Aktiviere Proxy für Audios

source: Defines how external audios are handled.
de_de: Legt fest, wie externe Audios behandelt werden.

source: Mode for audio handling
de_de: Modus für Audio-Bearbeitung

source: If this option is enabled all external files will be saved local during uninstallation of this plugin.
de_de: Wenn diese Option aktiviert ist, werden alle externen Dateien bei Deinstallation des Plugins lokal gespeichert.

source: Switch external files to local hosting during uninstallation
de_de: Externe Dateien während der Deinstallation auf lokales Hosting umstellen

source: Advanced settings
de_de: Erweiterte Einstellungen

source: Proxy settings
de_de: Proxy-Einstellungen

source: Video Settings
de_de: Video-Einstellungen

source: Audio Settings
de_de: Audio-Einstellungen

source: Permissions to add files
de_de: Berechtigungen zum Hinzufügen von Dateien

source: Advanced
de_de: Erweitert

source: Images
de_de: Bilder

source: Permissions
de_de: Berechtigungen

source: Queue schedule ended.
de_de: Warteschlangenausführung beendet.

source: Queue schedule starting.
de_de: Warteschlangenausführung gestartet.

source: Check file schedule ended.
de_de: Dateiprüfung gestartet.

source: Check file schedule starting.
de_de: Dateiprüfung beendet.

source: Not enabled cron event <i>%1$s</i> automatically removed.
de_de: Nicht aktiviertes Cron-Event <i>%1$s</i> automatisch entfernt.

source: Missing cron event <i>%1$s</i> automatically re-installed.
de_de: Fehlendes Cron-Ereignis <i>%1$s</i> wurde automatisch neu installiert.

source: <strong>Your have installed <i>External files for media library</i> - great and thank you!</strong> You can now immediately add external URLs to your media library <a href="%1$s">here</a>.
de_de: <strong>Du hast <i>Externe Dateien in der Mediathek</i> installiert - großartig und danke!</strong> Du kannst jetzt sofort externe URLs zu deiner Mediathek <a href="%1$s">hier</a> hinzufügen.

source: Disabled
de_de: Deaktiviert

source: Error on decrypting with PHP-sodium. Please contact <a href="%1$s">our support forum</a> about this problem.
de_de: Fehler beim Entschlüsseln mit PHP-Sodium. Bitte kontaktiere <a href="%1$s">unser Supportforum</a> über dieses Problem.

source: Error on encrypting with PHP-sodium. Please contact <a href="%1$s">our support forum</a> about this problem.
de_de: Fehler beim Verschlüsseln mit PHP-Sodium. Bitte kontaktiere <a href="%1$s">unser Supportforum</a> über dieses Problem.

source: No supported encryption method found. Please contact <a href="%1$s">our support forum</a> about this problem.
de_de: Keine Verschlüsselungs-Methode gefunden. Bitte kontaktiere <a href="%1$s">unser Supportforum</a> über dieses Problem.

source: Error-URLs has been removed from the queue.
de_de: Fehler-URLs wurden aus der Warteschlange entfernt.

source: Files have been switches to local hosting.
de_de: Dateien haben zum lokalen Hosting gewechselt.

source: Files have been switches to external hosting.
de_de: Dateien haben zum externen Hosting gewechselt.

source: Plugin have been reset.
de_de: Plugin wurde zurückgesetzt.

source: Plugin have been reset via cli.
de_de: Plugin wurde per WP CLI zurückgesetzt.

source: URL-check has been run.
de_de: URL-Prüfung wurde ausgeführt.

source: Log has been cleared via cli.
de_de: Protokoll wurde per WP CLI geleert.

source: %1$d URLs have been deleted.
de_de: %1$d URLs wurden entfernt.

source: Deleting external files from media library
de_de: Lösche externe Dateien aus Mediathek.

source: There are no external URLs to delete.
de_de: Es gibt keine externen URLs zum Löschen.

source: No files found to delete.
de_de: Keine Dateien zum Löschen gefunden.

source: External files will be deleted via WP CLI.
de_de: Externe Dateien werden per WP CLI gelöscht.

source: Results of the import:
de_de: Ergebnis des Imports:

source: %1$s could not be saved in media library. Take a look in the log for details.
de_de: %1$s konnte nicht in der Mediathek gespeichert werden. Schau im Protokoll nach für Details dazu.

source: %1$s has been added to the queue. It will be imported automatically in your media library.
de_de: %1$s wurde zur Warteschlange hinzugefügt. Sie wird automatisch in die Mediathek importiert werden.

source: %1$s has been saved in media library.
de_de: %1$s wurde in der Mediathek gelöscht.

source: %1$s is not a valid URL and will not be saved.
de_de: %1$s ist keine gültige URL und wird nicht gespeichert.

source: Import files from given URL
de_de: Importiere Dateien von angegebener URL

source: Ask in our forum
de_de: Frag in unserem Forum

source: Question not answered?
de_de: Deine Frage wurde nicht beantwortet?

source: The above-mentioned detection is based on the language you use in WordPress. If you are not affected by the GPRD-rules, we apologize for this information. You can hide it at any time <a href="%1$s">by click on this link</a>.
de_de: Die oben erwähnte Erkennung basiert auf der Sprache, die du in WordPress verwendest. Wenn du nicht von den DSGVO-Regeln betroffen bist, entschuldigen wir uns für diese Information. Du kannst den Hinweis <a href="%1$s">über diesen Link</a> dauerhaft ausblenden.

source: Please note that according to these rules, the use of external, directly loaded files (such as images or videos) in a website requires active information to the visitor before these files are loaded. We recommend that you use the proxy mode offered when using <i>External Files for Media Library</i>. This means that the files are not loaded directly from an external source but are cached locally. If you have any further questions about these rules, please contact your legal advisor.
de_de: Bitte beachte, dass nach diesen Regeln die Verwendung von externen, direkt geladenen Dateien (wie z.B. Bilder oder Videos) in einer Website eine aktive Information des Besuchers erfordert, bevor diese Dateien geladen werden. Wir empfehlen dir, bei der Verwendung von <i>Externen Dateien für die Mediathek</i> den angebotenen Proxy-Modus zu verwenden. Dies bedeutet, dass die Dateien nicht direkt von einer externen Quelle geladen werden, sondern lokal zwischengespeichert werden. Solltest du weitere Fragen zu diesen Regeln haben, wende dich bitte an deinen Rechtsbeistand.

source: Your website seems to be subject to the European Union rules of the <a href="%1$s" target="_blank">GPRD (opens new window)</a>!
de_de: Deine Website scheint von den Regeln zur <a href="%1$s" target="_blank">DSGVO (öffnet neues Fenster)</a> von der Europäischen Union betroffen zu sein!

source: The log entry has been deleted.
de_de: Der Protokolleintrag wurde gelöscht.

source: Talk to your hosting support team about this.
de_de: Sprich mit dem Support deines Hosters hierüber.

source: Future versions of <i>External Files in Media Library</i> will no longer be compatible with PHP 8.1 or older. These versions <a href="https://www.php.net/supported-versions.php" target="_blank">will be outdated</a> after December 2025. To continue using the plugins new features, please update your PHP version.
de_de: Zukünftige Versionen von <i>Externe Dateien in der Mediathek</i> werden nicht länger mit PHP 8.1 oder älter kompatibel sein. Diese Versionen seit Dezember 2025 <a href="https://www.php.net/supported-versions.php" target="_blank">sind veraltet</a>. Aktualisiere die PHP-Version um auch künftig neue Funktionen des Plugins nutzen zu können.

source: Your website is using an old PHP-version!
de_de: Deine Website verwendet eine veraltete PHP-Version!

source: <strong>External files could not be used as no mime-types are allowed.</strong> Go to <a href="%1$s">Settings</a> to choose mime-types you want to use.
de_de: <strong>Externe Dateien können nicht verwendet werden, da kein Mime-Type erlaubt ist.</strong> Gehe zu den <a href="%1$s">Einstellungen</a> um Mime-Types zu wählen die du verwenden möchtest.

source: The queue entry has been deleted.
de_de: Der Eintrag der Warteschlange wurde gelöscht.

source: Database-Error: %1$s
de_de: Datenbank-Fehler: %1$s
