Repository: threadi/external-files-in-media-library
Catalog: languages/external-files-*-media-library-*.po
Languages: de_de

source: Error entries from queue has been deleted.
de_de: Fehlereinträge in der Warteschlange wurden gelöscht.

source: The queue has been cleared.
de_de: Die Warteschlange wurde geleert.

source: The entry has been processed.
de_de: Der Eintrag wurde verarbeitet.

source: The queue has been processed.
de_de: Die Warteschlange wurde verarbeitet.

source: Processing the import of %1$d URL from queue ended.
de_de: Verarbeitung vom Import von einer URL beendet.

source: Processing the import of %1$d URL from queue.
de_de: Verarbeitung vom Import von einer URL läuft.

source: URL is already in queue.
de_de: URL ist bereits in Warteschlange.

source: Queue schedule interval has changed.
de_de: Der Zeitplan für die Warteschlange wurde verändert.

source: Queue schedule has been disabled.
de_de: Die automatische Verarbeitung der Warteschlange wurde deaktiviert.

source: An interval has to be set.
de_de: Es muss ein Intervall gesetzt werden.

source: Queue
de_de: Warteschlange

source: Set the limit of URLs which will be process per cycle.
de_de: Setze die Anzahl der zu verarbeitenden URLs pro Durchlauf

source: To process per queue cycle
de_de: Pro Durchlauf zu verarbeiten

source: Defines the time interval in which the queue for new URLs will be processed.
de_de: Definiert das zeitliche Intervall in dem die Warteschlange für neue URLs verarbeitet wird.

source: Set interval for queue processing
de_de: Setze Intervall für Verarbeitung

source: Proxy cache has been reset via AJAX.
de_de: Proxy Cache wurde per AJAX zurückgesetzt.

source: The proxy has been reset.
de_de: Der Proxy wurde zurückgesetzt.

source: Proxy has been reset
de_de: Proxy wurde zurückgesetzt

source: Proxy could not create cache directory.
de_de: Proxy konnte das Cache-Verzeichnis nicht erstellen.

source: Proxy could not load cached file %1$s.
de_de: Proxy konnte die zwischengespeicherte Datei %1$s nicht laden.

source: Proxy will create cache for the file.
de_de: Proxy wird einen Zwischenspeicher für die Datei erzeugen.

source: Proxy could not load the filename %1$s as external file.
de_de: Proxy konnte den Dateinamen %1$s nicht als externe Datei laden.

source: Proxy tries to load the filename %1$s.
de_de: Proxy versucht den Dateinamen %1$s zu laden.

source: SSH/SFTP-Connection failed. Check the server-name %1$s and the given credentials. Error: %2$s
de_de: SSH/SFTP-Verbindung fehlgeschlagen. Prüfe den Servernamen %1$s und die angegebenen Zugangsdaten. Fehler: %2$s

source: SFTP-directory returns no files.
de_de: SFTP-Verzeichnis enthält keine Dateien.

source: SFTP-URL looks not like a URL.
de_de: SFTP-URL sieht nicht aus wie eine URL.

source: Missing credentials for import from SFTP-URL.
de_de: Zugangsdaten für den Import von SFTP-URL fehlen.

source: Given URL has been added to queue.
de_de: Angegebene URL wurde zur Warteschlange hinzugefügt.

source: Given URL already exist in media library as local file.
de_de: Angegebene URL existiert in der Mediendatenbank bereits als lokale Datei.

source: The presumed directory URL does not contain any linked files.
de_de: Das vermutete Verzeichnis der URL enthält keine verlinkten Dateien.

source: The presumed directory URL could not be loaded.
de_de: Das vermutete Verzeichnis konnte nicht geladen werden.

source: Temp file could not be created because of the following error: %1$s
de_de: Temporäre Datei konnte wegen folgendem Fehler nicht erstellt werden: %1$s

source: Given URL response with HTTP-status %1$d.
de_de: Angegebene URL antwortet mit HTTP-Status %1$d

source: FTP-Connection failed. Check the servername %1$s and the given credentials. Error: %2$s
de_de: FTP-Verbindung fehlgeschlagen. Prüfe den Servernamen %1$s und die angegebenen Zugangsdaten. Fehler: %2$s

source: Check files from presumed directory URL %1$s
de_de: Prüfe Dateien in der vermuteten Verzeichnis URL %1$s

source: FTP-directory returns no files.
de_de: FTP-Verzeichnis enthält keine Dateien.

source: FTP-path looks not like a URL.
de_de: FTP-Pfad sieht nicht aus wie eine URL.

source: Missing credentials for import from FTP-path.
de_de: Zugangsdaten für den Import vom FTP-Pfad fehlen.

source: File-URL does not exist.
de_de: FTP-URL existiert nicht.

source: Check files from presumed directory path %1$s
de_de: Prüfe Dateien im vermuteten Verzeichnis-Pfad %1$s

source: Given URL is using a not supported TCP protocol. You will not be able to use this URL for external files in media library.
de_de: Angegebene URL verwendet kein unterstütztes TCP-Protokoll. Du wirst diese URL nicht als externe Datei in der Mediathek verwenden können.

source: Add credentials to access these URLs
de_de: Ergänze Zugangsdaten für den Zugriff auf diese URLs

source: Add these URLs to the queue that is processed in the background.
de_de: Füge diese URLs zur Warteschlange hinzu, die im Hintergrund verarbeitet wird.

source: Hint:
de_de: Hinweis:

source: Password
de_de: Passwort

source: Add credentials to access this URL
de_de: Ergänze Zugangsdaten für den Zugriff auf diese URL

source: Enter the URL of an external file you want to insert in your library
de_de: Gib eine URL für eine Datei ein, die du deiner Mediathek hinzufügen möchtest

source: Saving URL %1$s ..
de_de: Speichere URL %1$s ..

source: Checking URL %1$s ..
de_de: Prüfe URL %1$s ..

source: Import of presumed directory URL %1$s starting ..
de_de: Import vom vermuteter Verzeichnis-URL %1$s startet ..

source: Go to media library
de_de: Gehe zu Mediathek

source: The import has checked %1$d URL with the following result:
de_de: Der Import hat eine URL mit folgendem Ergebnis geprüft:

source: Go to queue
de_de: Gehe zu Warteschlange

source: Go to logs
de_de: Gehe zum Protokoll

source: Finalized
de_de: Abgeschlossen

source: They might have been added to the queue if you used this option.
de_de: Sie könnten eventuell zur Warteschlange hinzugefügt wurden sein, wenn du diese Option verwendet hast.

source: No URLs have been imported.
de_de: Es wurden keine URLs importiert.

source: End of AJAX-request to import URLs.
de_de: Ende vom AJAX-Request zum Import von URLs.

source: Error occurred during check of URL. The URL has not been added.
de_de: Fehler beim Prüfen der URL. Sie wird nicht hinzugefügt.

source: Try to import the URL.
de_de: Versuche die Datei zu importieren.

source: URLs has been transferred via AJAX and will now be checked and imported.
de_de: URLs wurden per AJAX übermittelt und werden jetzt geprüft und importiert.

source: AJAX-request to import URLs has been called.
de_de: AJAX-Request zum Importieren von URLs wurde aufgerufen.

source: Add external files via their URL <a href="%1$s" target="_blank">here (opens new window)</a>.
de_de: Füge externe Dateien über ihre URL <a href="%1$s" target="_blank">hier (öffnet neues Fenster)</a> hinzu.

source: Add URLs of external files
de_de: Externe Dateien über ihre URLs hinzufügen

source: The hosting of the file will be changed.
de_de: Das Hosting der Datei wird geändert.

source: Please wait
de_de: Bitte warten

source: An error occurred
de_de: Es ist ein Fehler aufgetreten

source: The following error occurred:
de_de: Der folgende Fehler trat auf:

source: It is no problem to continue using the URL in your media library.
de_de: Es ist kein Problem diese URL in deiner Mediathek weiterhin zu verwenden.

source: The following errors occurred:
de_de: Die folgenden Fehler traten auf:

source: The following URLs were successfully imported:
de_de: Die folgenden URLs wurden erfolgreich importiert:

source: Close
de_de: Schließen

source: The specified URLs have been processed.
de_de: Die angegebenen URLs wurden verarbeitet.

source: File type could not be detected. Fallback to general file.
de_de: Dateityp nicht ermittelbar. Verwende Standard Dateityp.

source: Take a look at your added external files in the media library.
de_de: Wirf einen Blick auf deine hinzugefügten externen Dateien in der Mediathek.

source: Wait until you get an answer.
de_de: Warte bis du eine Antwort erhältst.

source: Click on "Add URLs".
de_de: Klicke auf "URLs hinzufügen".

source: Optionally add credentials below the field.
de_de: Optional kannst du unterhalb des Feldes Zugangsdaten hinzufügen.

source: Paste the URLs you want to add in the field in the new dialog.
de_de: Füge in das Feld in dem neuen Dialog die URLs ein die du hinzufügen willst.

source: Click on the button "Add external files".
de_de: Klicke auf den Button "Hinzufügen externer Dateien".

source: Go to Media > <a href="%1$s">Add Media File</a>.
de_de: Gehe zu Medien > <a href="%1$s">Neue Mediendatei hinzufügen</a>.

source: How to use
de_de: Wie es funktioniert

source: The plugin allows you to integrate external files into your media library. These are then handled in exactly the same way as other files that you upload here. You can integrate them into your website as you are used to.
de_de: Das Plugin ermöglicht es dir, externe Dateien in deine Mediendatanbank zu integrieren. Diese werden dann genau so behandelt wie andere Dateien, die du hier hochladen kannst. Du kannst sie wie gewohnt in deine Website einbinden.

source: Upload external files
de_de: Hochladen externer Dateien

source: Import process was terminated because it took too long and would have reached the maximum execution time in hosting. The files to be imported were saved in the queue and are now automatically imported individually.
de_de: Der Importvorgang wurde abgebrochen, weil er zu lange dauerte und die maximale Ausführungszeit im Hosting erreicht hätte. Die zu importierenden Dateien wurden in der Warteschlange gespeichert und werden nun automatisch einzeln importiert.

source: File is now extern hosted.
de_de: Die Datei wird jetzt extern gehostet.

source: Mime type:
de_de: MIME-Typ:

source: Reset thumbnails
de_de: Vorschaubilder zurücksetzen

source: Show log entries
de_de: Zeige Protokolleinträge

source: File is protected with login and password.
de_de: Datei ist mit Login und Passwort geschützt.

source: External URL of this file:
de_de: Externe URL von dieser Datei:

source: External file object for URL could not be loaded.
de_de: Externes Dateiobjekt für URL konnte nicht geladen werden.

source: Save file from URL
de_de: Speichere Datei von URL

source: URL has been added to queue.
de_de: URL wurde zur Warteschlange hinzugefügt.

source: No files found under given URL.
de_de: Keine Dateien unter der angegebenen URL gefunden.

source: File has been switched the hosting.
de_de: Datei hat das Hosting gewechselt.

source: Given file is not an external file.
de_de: Angegebene Datei ist keine externe Datei.

source: Switch to local
de_de: Wechseln zu lokal

source: Switch to extern
de_de: Wechseln zu extern

source: The hosting of this file has been changed.
de_de: Das Hosting dieser Datei wurde geändert.

source: Hosting changed
de_de: Hosting verändert

source: File is extern hosted.
de_de: Datei wird extern gehosted.

source: File is local hosted.
de_de: Datei wird lokal gehosted.

source: Importing URL %1$s
de_de: Importiere URL %1$s

source: Import of URLs starting ..
de_de: Import von URLs startet ..

source: Add external file
de_de: Externe Datei hinzufügen

source: Add URL
de_de: URL hinzufügen

source: Settings
de_de: Einstellungen

source: Add external files
de_de: Externe Dateien hinzufügen

source: Add URLs
de_de: URLs hinzufügen

source: The file is available.
de_de: Die Datei ist erreichbar.

source: The file is NOT available.
de_de: Die Datei ist NICHT erreichbar.

source: Availability refreshed
de_de: Erreichbarkeit geprüft

source: Please enter one or more URLs to import in the field.
de_de: Bitte gibt eine oder mehr URLs zum Import in das Feld ein.

source: No URLs given
de_de: Keine URLs angegeben

source: The following URL have been saved successfully:
de_de: Die folgende URL wurde erfolgreich importiert

source: Cancel
de_de: Abbrechen

source: Import has been run
de_de: Import wurde durchgeführt

source: Import of URLs running
de_de: Import von URLs läuft

source: Questions? Check our forum
de_de: Fragen? Schau in unser Forum

source: Rate this plugin
de_de: Bewerte dieses Plugin

source: Choose the mime-types you wish to allow as external URL. If you change this setting, already used external files will not change their accessibility in frontend. If you miss a mime-type, take a look <a href="%1$s" target="_blank">at our hooks (opens new window)</a>.
de_de: Wählen einen die Content-Typ, die du als externe URL zulassen willst. Wenn du diese Einstellung änderst, werden bereits verwendete externe Dateien im Frontend nicht verändert. Wenn du einen Content-Typ vermisst, ergänze einen <a href="%1$s" target="_blank">über unsere Hooks</a>.

source: The given mime-type is not supported. Setting will not be saved.
de_de: Der angegebene Content-type wird nicht Unterstützung. Einstellung wird nicht gespeichert.

source: The given interval %1$s does not exists.
de_de: Das angegebene Intervall %1$s existiert nicht.

source: Logs
de_de: Protokolle

source: URL-File is NOT available! Check <a href="%1$s">the log</a> for details.
de_de: URL-Datei ist nicht erreichbar. Prüfe <a href="%1$s">das Log</a> für Details dazu.

source: No ID given.
de_de: Keine ID angegeben.

source: File is not cached in proxy.
de_de: Datei ist keine über den Proxy gecachte Datei.

source: File is delivered through proxied cache.
de_de: Datei wird über einen Proxy-Cache bereitgestellt.

source: Recheck availability
de_de: Verfügbarkeit prüfen

source: File-URL is NOT available! Check <a href="%1$s">the log</a> for details.
de_de: Datei-URL ist nicht erreichbar. Prüfe <a href="%1$s">das Log</a> für Details dazu.

source: File-URL is available.
de_de: Datei-URL ist erreichbar.

source: External file
de_de: Externe Datei

source: no external URLs
de_de: nur nicht externe URLs

source: only external URLs
de_de: nur externe URLs

source: All files
de_de: Alle Dateien

source: Enter one URL per line for external files you want to insert in your library
de_de: Gibt eine URL pro Zeile für die Dateien ein, die du deiner Mediathek hinzufügen möchtest

source: External files in Medias Library
de_de: Externe Dateien in der Mediathek

source: Settings for External files in Media Library
de_de: Einstellungen für externe Dateien in der Mediathek

source: Defines how long images, which are loaded via our own proxy, are saved locally. After this time their cache will be renewed.
de_de: Legt fest, wie lange Bilder, die über unseren eigenen Proxy geladen werden, lokal gespeichert werden. Nach dieser Zeit wird ihr Cache erneuert.

source: Max age for cached images in proxy in hours
de_de: Höchstalter für zwischengespeicherte Bilder im Proxy in Stunden

source: This option is only available if images are hosted external. If this option is disabled, external images will be embedded with their external URL. To prevent privacy protection issue you could enable this option to load the images locally.
de_de: Diese Option ist nur verfügbar, wenn die Bilder extern gehostet werden. Wenn diese Option deaktiviert ist, werden die externen Bilder mit ihrer externen URL eingebettet. Um Probleme mit dem Datenschutz zu vermeiden, kannst Du diese Option aktivieren, um die Bilder lokal zu laden.

source: Enable proxy for images
de_de: Aktiviere Proxy für Bilder

source: download and host them local
de_de: runterladen und lokal hosten

source: host them extern
de_de: extern hosten

source: Defines how external images are handled.
de_de: Legt fest, wie externe Bilder behandelt werden.

source: Mode for image handling
de_de: Modus für Bild-Bearbeitung

source: Images Settings
de_de: Bild-Einstellungen

source: This is only a fallback if the actual user is not available (e.g. via CLI-import). New files are normally assigned to the user who add them.
de_de: Dies ist nur ein Fallback, wenn der eigentliche Benutzer nicht verfügbar ist (z. B. über CLI-Import). Neue Dateien werden normalerweise dem Benutzer zugewiesen, der sie hinzugefügt hat.

source: User new files should be assigned to
de_de: Benutzer dem neue Dateien zugewiesen werden

source: Select roles which should be allowed to add external files.
de_de: Wähle die Rollen aus, denen es erlaubt sein soll, externe Dateien hinzuzufügen.

source: Select user roles
de_de: Benutzerrollen auswählen

source: If this option is enabled all URL-files will be deleted during deinstallation of this plugin.
de_de: Wenn diese Option aktiviert ist, werden alle URL-Dateien bei der Deinstallation des Plugins gelöscht.

source: Delete all data on uninstallation
de_de: Lösche alle Daten bei Deinstallation

source: log all
de_de: alles loggen

source: log warnings
de_de: Warnungen loggen

source: Select allowed mime-types
de_de: Erlaubte Content-Types auswählen

source: Defines the time interval in which files with URLs are automatically checked for its availability.
de_de: Legt das Zeitintervall fest, in dem Dateien mit URLs automatisch auf ihre Verfügbarkeit geprüft werden.

source: Set interval for file-check
de_de: Intervall für die Dateiprüfung festlegen

source: Disable the attachment page for URL-files
de_de: Deaktiviere die Anhangseite für URL-Dateien

source: This is handled by Yoast SEO.
de_de: Das wird durch Yoast SEO übernommen.

source: Each file in media library has a attachment page which could be called in frontend. With this option you can disable this attachment page for files with URLs.
de_de: Jede Datei in der Mediathek hat eine Anhangseite, die im Frontend aufgerufen werden kann. Mit dieser Option kannst du diese Anhangsseite für Dateien mit URLs deaktivieren.

source: General Settings
de_de: Allgemeine Einstellungen

source: State
de_de: Status

source: Mime-type is not allowed
de_de: Content-type ist nicht erlaubt

source: URL has been deleted from media library.
de_de: Die URL wurde aus der Mediathek gelöscht.

source: Given URL response with the disallowed mime-type %1$s.
de_de: Die angegebene URL antwortet mit einem nicht zulässigen Content-type %1$s.

source: Given URL response without Content-type.
de_de: Die angegebene URL verfügt über keinen Content-Type.

source: Given URL already exist in media library.
de_de: Die angegebene URL existiert bereits in der Mediathek.

source: Given string %1$s is not a valid URL.
de_de: Die angegebene Zeichenkette %1$s ist keine gültige URL.

source: The URL could not be saved due to the following error: %1$s
de_de: URL konnte wegen des folgenden Fehlers nicht gespeichert werden: %1$s

source: URL successfully added in media library.
de_de: URL erfolgreich in Mediathek hinzugefügt.

source: Dismiss this notice.
de_de: Diesen Hinweis ausblenden.

source: Enables the Media Library to use external files.
de_de: Ermöglicht es der Mediathek, externe Dateien zu verwenden.

source: External files in Media Library
de_de: Externe Dateien in der Mediathek
