Repository: threadi/external-files-in-media-library
Catalog: languages/external-files-*-media-library-*.po
Languages: de_de

source: Import in specific folder of Filebird
de_de: In bestimmten Ordner von Filebird importieren

source: Assign files to categories
de_de: Dateien Kategorien zuordnen

source: Choose categories:
de_de: Kategorien auswählen:

source: Choose folder:
de_de: Ordner wählen:

source: Import in specific folder of CatFolder
de_de: In bestimmten Ordner von CatFolder importieren

source: None
de_de: Keine

source: Choose folder as target:
de_de: Wähle Ordner als Ziel:

source: Import active directory via queue
de_de: Importiere aktives Verzeichnis über Warteschlange

source: Import active directory now
de_de: Importiere aktives Verzeichnis jetzt

source: Using Imgur
de_de: Imgur verwenden

source: Paste the earlier copied URL in the field in the new dialog.
de_de: Füge die vorher kopierte URL in das Feld im neuen Dialog ein.

source: Right-click on the uploaded image and copy its URL.
de_de: Rechtsklick auf das hochgeladene Bild und kopiere die URL.

source: Upload your image on Imgur.
de_de: Lade dein Bild bei Imgur hoch.

source: How to add them
de_de: Wie man sie hinzufügt

source: URLs beginning with <code>https://i.imgur</code> can be used as an image in the Media Library.
de_de: URLs die mit <code>https://i.imgur</code> beginnen können als Bild in der Mediathek verwendet werden.

source: URLs beginning with <code>https://imgur</code> can only be used for embedding. They cannot be used in the Media Library.
de_de: URLs beginnend mit <code>https://imgur</code> können nur eingebettet werden. Sie können nicht in der Mediathek verwendet werden.

source: Please note the following when using Imgur:
de_de: Bitte beachte das Folgende wenn du Imgur verwendest:

source: Using images from Imgur
de_de: Bilder von Imgur verwenden

source: Given Imgur-URL could not be used as external embed image in websites. This URL can be used for embedding, but not for selecting images.
de_de: Die angegebene Imgur-URL kann nicht als externes Bild in Websites verwendet werden. Diese URL kann zum Einbetten genutzt werden, aber nicht zur Auswahl von Bildern.

source: Save active directory as directory archive
de_de: Speichere aktives Verzeichnis als Verzeichnisarchiv.

source: Synchronization schedule ended.
de_de: Synchronisation beendet.

source: To synchronize external directory does not have any configuration.
de_de: Das zu synchronisierende Verzeichnis hat keinerlei Konfiguration.

source: Synchronization listing object unknown:
de_de: Synchronisierungsobjekt ist unbekannt:

source: Synchronization schedule starting.
de_de: Synchronisierung gestartet.

source: every week
de_de: jede Woche

source: every 24 hours
de_de: alle 24 Stunden

source: every 12 hours
de_de: alle 12 Stunden

source: every 6 hours
de_de: alle 6 Stunden

source: every 4 hours
de_de: alle 4 Stunden

source: every 3 hours
de_de: alle 3 Stunden

source: every 2 hours
de_de: alle 2 Stunden

source: every hour
de_de: jede Stunde

source: every 30 Minutes
de_de: alle 30 Minuten

source: every 20 Minutes
de_de: alle 20 Minuten

source: every 15 Minutes
de_de: alle 15 Minuten

source: With directory archives, you can easily save your frequently used connections to external directories and reuse them at any time. Whats more, you can also use them to automatically synchronize the files with your media library.
de_de: Mit Verzeichnisarchiven kannst du einfach deine häufig genutzten Verbindungen zu externen Verzeichnissen speichern und jederzeit wieder verwenden. Mehr noch kannst du sie auch zur automatischen Synchronisierung der Dateien deiner Mediathek verwenden.

source: Directory Archive deleted.
de_de: Verzeichnisarchiv gelöscht.

source: Directory Archive updated.
de_de: Verzeichnisarchiv aktualisiert.

source: No Directory Archives found. <a href="%1$s">Add them</a> from your external files sources.
de_de: Kein Verzeichnisarchiv gefunden. Füge sie <a href="%1$s">über deine externen Dateiquellen</a> ein.

source: Back to Directory Archives
de_de: Zurück zum Verzeichnisarchiv

source: Directory Archives
de_de: Verzeichnisarchive

source: Update Directory Archive
de_de: Aktualisiere Verzeichnisarchiv

source: Edit Directory Archive
de_de: Bearbeite Verzeichnisarchiv

source: Search Directory Archive
de_de: Suche Verzeichnisarchiv

source: Select the source of your external files
de_de: Wähle die Quelle deiner externen Dateien

source: Last synchronized at %1$s from %2$s
de_de: Zuletzt synchronisiert um %1$s von %2$s

source: Sync of files running ..
de_de: Synchronisierung von Dateien läuft ..

source: Synchronized from:
de_de: Synchronisiert von:

source: Last synchronized:
de_de: Zuletzt synchronisiert:

source: The files are now synchronized in your media library.
de_de: Die Dateien sind jetzt mit deiner Mediathek synchronisiert.

source: Synchronization has been executed
de_de: Synchronisation wurde ausgeführt.

source: Sync of files starting ..
de_de: Synchronisation von Dateien startet ..

source: Requested external directory does not have any configuration.
de_de: Angefordertes externes Verzeichnis hat keinerlei Konfiguration.

source: No external directory given for synchronization.
de_de: Kein externes Verzeichnis zur Synchronisation angegeben.

source: Requested method is unknown:
de_de: Angeforderte Methode ist unbekannt:

source: No method given for synchronization.
de_de: Keine Methode für Synchronisation angegeben.

source: Synchronization cleanup ended.
de_de: Bereinigung nach Synchronisierung beendet.

source: Synchronization ended.
de_de: Synchronisierung beendet.

source: Synchronization startet.
de_de: Synchronisierung gestartet.

source: Configure
de_de: Konfigurieren

source: Now
de_de: Jetzt

source: Off
de_de: Aus

source: On
de_de: An

source: Save
de_de: Speichern

source: Configure interval which will be used to automatically synchronize this external directory with your media library.
de_de: Konfiguriere das Intervall, welches zur automatischen Synchronisierung dieses externen Verzeichnisses mit deiner Mediathek genutzt wird.

source: Set interval for %1$s
de_de: Setze Intervall für %1$s

source: Choose interval:
de_de: Wähle Intervall:

source: Yes, synchronize now
de_de: Ja, synchronisiere jetzt

source: Synchronization may take some time.
de_de: Die Synchronisierung kann einige Zeit benötigen.

source: Files that do not belong to this source remain untouched.
de_de: Dateien, die nicht zu dieser Quelle gehören, bleiben unverändert.

source: New files are imported, existing files are retained, files that no longer exist in the source are deleted from the media library.
de_de: Neue Dateien werden importiert, vorhandene Dateien bleiben erhalten, Dateien die nicht mehr in der Quelle existieren werden aus der Mediathek gelöscht.

source: During synchronization, files are synchronized between the source and the media library.
de_de: Während der Synchronisierung werden Dateien zwischen der Quelle und der Mediathek abgeglichen.

source: Are you sure you want to synchronize files from this external directory with your media library?
de_de: Bist du sicher, dass du die Dateien von diesem externen Verzeichnis mit deiner Mediathek synchronisieren willst?

source: Synchronize now?
de_de: Jetzt synchronisieren?

source: Synchronized files
de_de: Synchronisierte Dateien

source: Delete files in media library belonging to an external directory when the connection to the external directory is deleted.
de_de: Lösche Dateien in Mediathek die zu einem externen Verzeichnis gehören, wenn die Verbindung zu diesem gelöscht wird.

source: Delete synchronized files
de_de: Lösche synchronisierte Dateien

source: Delete files in the media library that are no longer in the external directory after each synchronization.
de_de: Lösche Dateien in der Mediathek die bei einer Synchronisierung nicht mehr im externen Verzeichnis existieren.

source: Delete unused files
de_de: Lösche nicht verwendete Dateien

source: If enabled every new external directory will automatically be synchronized.
de_de: Wenn aktiviert wird jedes neue externe Verzeichnis automatisch synchronisiert.

source: Enable automatic synchronization
de_de: Aktiviere automatische Synchronisation

source: Defines the time interval in which the synchronization for new external directories will be processed. This setting can be changed on each external directory.
de_de: Legt das Zeitintervall fest in dem die Synchronisation von neuen externen Verzeichnissen ausgeführt wird. Die Einstellung kann pro externem Verzeichnis angepasst werden.

source: Interval for synchronization
de_de: Intervall zur Synchronisation

source: If enabled you can synchronize any supported external directory with your media library.
de_de: Wenn aktiviert kannst Du jedes externe Verzeichnis mit deiner Mediathek synchronisieren.

source: Enable support for synchronization
de_de: Aktiviere Unterstützung für Synchronisation

source: Synchronization
de_de: Synchronisation

source: SFTP-URL could not be not read.
de_de: SFTP-URL konnte nicht gelesen werden.

source: SFTP-Connection failed.
de_de: SFTP-Verbindung fehlgeschlagen.

source: Error during check of availability of URL:
de_de: Fehler beim Prüfen der Verfügbarkeit von URL:

source: Could not get scheme and host from given URL.
de_de: Konnte kein Schema und keinen Host von angegebener URL ermitteln.

source: Could not get FTP-connection.
de_de: Konnte keine FTP-Verbindung herstellen.

source: The URL will remain external, we simply save the link to the file in the media library.
de_de: Die URL bleibt extern, wir speichern nur den Link zu der Datei in der Mediathek.

source: The temp file for the import was deleted.
de_de: Die temporäre Datei für den Import wurde gelöscht.

source: The URL is saved locally.
de_de: Die URL wurde lokal gespeichert.

source: URL has matched an entry on the blacklist.
de_de: URL entspricht einem Eintrag in der Blacklist.

source: Use a URL
de_de: Verwende eine URL

source: Add Directory Archive
de_de: Verzeichnisarchiv hinzufügen

source: The new interval has been saved.
de_de: Das neue Intervall wurde gespeichert.

source: Configuration saved
de_de: Konfiguration gespeichert

source: Synchronization in progress
de_de: Synchronisation in Bearbeitung

source: File under this URL has the type %1$s.
de_de: Datei unter dieser URL hat den Typ %1$s

source: You can find and use it <a href="%1$s">in the directory archive</a>.
de_de: Du kannst sie <a href="%1$s">im Verzeichnisarchiv</a> finden und verwenden.

source: The directory has been saved as archive.
de_de: Das Verzeichnis wurde als Archiv gespeichert.

source: Directory Archive saved
de_de: Verzeichnisarchiv gespeichert

source: The directory could not be saved as a directory archive.
de_de: Das Verzeichnis konnte nicht als Verzeichnisarchiv gespeichert werden.

source: Please choose a JSON-file with settings of <i>Fraunhofer Fokus</i> to import.
de_de: Bitte wähle eine JSON-Datei mit Einstellungen zum Import.

source: You can import this JSON-file in other projects using the WordPress plugin <i>Fraunhofer FOKUS</i>.
de_de: Du kannst diese JSON-Datei in andere Projekte importieren, indem du ebenfalls das WordPress-Plugin verwendest.

source: Edit this file
de_de: Diese Datei bearbeiten

source: The specified URL is available.
de_de: Die angegebene URL ist erreichbar.

source: URL-File is NOT available
de_de: URL-Datei ist NICHT erreichbar.

source: Need help?
de_de: Hilfe benötigt?

source: WooCommerce product gallery images will be saved as external files on the product.
de_de: WooCommerce Produktgalerie Bilder werden als externe Dateien am Produkt gespeichert.

source: WooCommerce product gallery images has been saved as external files.
de_de: Die Bilder der WooCommerce-Produktgalerie wurden als externe Dateien gespeichert.

source: Trying to save WooCommerce product gallery images as external files.
de_de: Versuche, die Bilder der WooCommerce-Produktgalerie als externe Dateien zu speichern.

source: Save external image file as WooCommerce Product main image.
de_de: Speichere die externe Bilddatei als Hauptbild des WooCommerce-Produkts.

source: WooCommerce Product main image has been imported as external file.
de_de: Das Hauptbild des WooCommerce-Produkts wurde als externe Datei importiert.

source: Trying to import main image of WooCommerce product as external image.
de_de: Versuche, das Hauptbild eines WooCommerce-Produkts als externes Bild zu importieren.

source: Given file is not a valid ZIP-file!
de_de: Die angegebene Datei ist keine gültige ZIP-Datei!

source: Given file does not exist!
de_de: Die angegebene Datei existiert nicht!

source: PHP-Modul zip is missing!
de_de: PHP-Modul zip fehlt!

source: The given path %1$s does not exist on your server.
de_de: Der angegebene Pfad %1$s existiert nicht auf deinem Server.

source: The given path %1$s does not end with ".zip"!
de_de: Der angegebene Pfad %1$s endet nicht mit ".zip"!

source: The given path does not end with ".zip"!
de_de: Der angegebene Pfad endet nicht mit ".zip"!

source: No ZIP-file given!
de_de: Keine ZIP-Datei angegeben!

source: No data of the file to extract from ZIP could not be loaded.
de_de: Es konnten keine Daten der zu extrahierenden Datei aus der ZIP geladen werden.

source: ZIP-file could not be opened for extracting a file from it.
de_de: ZIP-Datei konnte nicht geöffnet werden, um eine Datei daraus zu extrahieren.

source: ZIP-file to use for extracting a file does not exist.
de_de: Die ZIP-Datei, die zum Extrahieren einer Datei verwendet werden soll, existiert nicht.

source: PHP-Modul zip is missing! Please contact your hosting support about this problem.
de_de: PHP-Modul zip fehlt! Bitte kontaktiere deinen Hosting-Support zu diesem Problem.

source: Choose file from a ZIP-File
de_de: Datei aus einer ZIP-Datei auswählen

source: The given API credentials are wrong.
de_de: Die angegebenen API-Zugangsdaten sind falsch.

source: API Key missing for Youtube channel
de_de: API-Schlüssel für Youtube-Kanal fehlt

source: Channel ID missing for Youtube channel
de_de: Channel ID für Youtube-Kanal fehlt

source: Import all videos
de_de: Importiere alle Videos

source: Add from your YouTube channel
de_de: Vom Youtube-Kanal hinzufügen

source: Or add from YouTube channel
de_de: Oder vom Youtube-Kanal hinzufügen

source: Choose video from a Youtube channel
de_de: Wähle Video von einem Youtube-Kanal

source: Using directories
de_de: Verwende Verzeichnisse

source: Choose the files you want to import in your media library.
de_de: Wähle Dateien aus die du in deine Mediathek importieren willst.

source: Enter your credentials to use the service for your external directory.
de_de: Gib deine Anmeldedaten ein, um den Dienst für dein externes Verzeichnis zu nutzen.

source: Choose the service you want to use.
de_de: Wähle einen Dienst aus den du verwenden möchtest.

source: Go to Media > <a href="%1$s">Import from directory</a>.
de_de: Gehe zu Medien > <a href="%1$s">Import vom Verzeichnis</a>.

source: The plugin allows you to integrate files from external directories into your media library.
de_de: Das Plugin ermöglicht es dir, Dateien aus externen Verzeichnissen in deine Mediathek zu integrieren.

source: Get files from external directory
de_de: Dateien aus externem Verzeichnis abrufen

source: Add from local server directory
de_de: Aus lokalem Serververzeichnis hinzufügen

source: Or add from local server directory
de_de: Oder vom lokalen Serververzeichnis hinzufügen

source: Google Drive client could not download a requested file during mass-import! Error:
de_de: Google Drive-Client konnte eine angeforderte Datei während des Massenimports herunterladen! Fehler:

source: Google Drive client could not download the requested file! Error:
de_de: Der Google Drive-Client konnte die angeforderte Datei herunterladen! Fehler:

source: Google Drive client could not be initiated!
de_de: Google Drive-Client konnte nicht gestartet werden!

source: Access token missing to connect to Google Drive!
de_de: API-Token für die Verbindung zu Google Drive fehlt!

source: Given URL does not contain a file ID from Google Drive!
de_de: Die angegebene URL enthält keine Datei-ID von Google Drive!

source: Got error from Google for requested new OAuth token:
de_de: Habe einen Fehler von Google für das angeforderte neue OAuth-Token erhalten:

source: Got empty response for requested new Google OAuth token!
de_de: Habe eine leere Antwort für das angeforderte neue Google OAuth-Token erhalten!

source: Google OAuth token expired. Requesting a new one now.
de_de: Google OAuth-Token ist abgelaufen. Fordere jetzt ein neues an.

source: Token has not been refreshed for user %1$s.
de_de: Der Token wurde für den Benutzer %1$s nicht aktualisiert.

source: Token has been refreshed for user %1$s.
de_de: Der Token wurde für den Benutzer %1$s aktualisiert.

source: No access token found for any user!
de_de: Kein Zugriffstoken für irgendeinen Benutzer gefunden!

source: %1$d files found for user %2$s.
de_de: %1$d Dateien für Benutzer %2$s gefunden.

source: No files found for user %1$s!
de_de: Keine Dateien für Benutzer %1$s gefunden!

source: List of files could not be loaded from Google Drive for user %1$s. Error:
de_de: Liste der Dateien konnte nicht von Google Drive für den Nutzer %1$s geladen werden. Fehler:

source: User with ID %1$d could not be found!
de_de: Der Benutzer mit der ID %1$d konnte nicht gefunden werden!

source: Wrong format for access tokens!
de_de: Falsches Format für API-Token!

source: No access tokens found for any user!
de_de: Keine API-Token für irgendeinen Benutzer gefunden!

source: Error on request to get refreshed token.
de_de: Fehler bei der Anforderung, ein aktualisiertes Token zu erhalten.

source: Go to Google Drive
de_de: Gehe zu Google Drive

source: List of files could not be loaded from Google Drive. Error:
de_de: Liste der Dateien konnte nicht von Google Drive geladen werden. Fehler:

source: Add from your Google Drive
de_de: Von deinem Google Drive hinzufügen

source: Or add from your Google Drive
de_de: Oder von deinem Google Drive hinzufügen

source: Got error from Google OAuth:
de_de: Erhielt Fehler von Google OAuth:

source: New Google OAuth token saved for user %1$s.
de_de: Neuer Google OAuth token wurde für den Nutzer %1$s gespeichert.

source: Show trashed files
de_de: Zeige gelöschte Dateien

source: Show shared files
de_de: Zeige geteilte Dateien

source: View and import files
de_de: Zeige und importiere Dateien

source: Created at %1$s
de_de: Erstellt am %1$s

source: Disconnect
de_de: Trennen

source: Disconnect now
de_de: Verbindung trennen

source: Files you downloaded in the media library will still be there and usable.
de_de: Dateien, die in die Mediathek heruntergeladen wurden, sind weiterhin vorhanden und können verwendet werden.

source: Click on the button below to disconnect your Google Drive from your website.
de_de: Klicke auf den Button unten, um die Verbindung zwischen deinem GoogleDrive und deiner Website zu trennen.

source: Disconnect Google Drive
de_de: Google Drive trennen

source: API connection
de_de: API Verbindung

source: Connect now
de_de: Jetzt verbinden

source: Click on the button below to connect your Google Drive with your website.
de_de: Klicke auf den Button unterhalb um dein Google Drive mit deiner Website zu verbinden.

source: You will also be directed to the website of the plugin developer. This is necessary to allow you to easily share your Google Drive account. No data about you will be stored in this context.
de_de: Du wirst auf Website des Plugin-Entwicklers weitergeleitet. Dies ist erforderlich, damit du dein Google Drive-Konto problemlos freigeben kannst. In diesem Zusammenhang werden keine Daten von dir gespeichert.

source: You will be directed to a Google dialog. Follow this and confirm the approvals.
de_de: Du wirst zu deinem einem Google-Dialog weitergeleitet. Folge diesem und bestätige die Genehmigungen.

source: Connect Google Drive
de_de: Google Drive verbinden

source: Choose file from your Google Drive
de_de: Wähle Datei von deinem Google Drive

source: Connection to FTP failed! Reason:
de_de: Verbindung per FTP fehlgeschlagen. Grund:

source: Connection to FTP failed! Check the log for details.
de_de: Verbindung per FTP fehlgeschlagen! Prüfe das Protokoll für Details dazu.

source: Given URL is not a FTP-path! Should be one of sftp:// or ftps://.
de_de: Die angegebene URL ist kein FTP-Pfad! Dieser sollte sftp:// oder ftps:// sein.

source: Import active directory
de_de: Importiere aktuelles Verzeichnis

source: Add from FTP server directory
de_de: Vom FTP-Verzeichnis hinzufügen

source: Or add from FTP-server directory
de_de: Oder von deinem FTP-Verzeichnis

source: Choose file from a FTP server
de_de: Wähle Datei von einem FTP-Server

source: No entries found.
de_de: Keine Einträge gefunden.

source: Entry
de_de: Eintrag

source: We recommend emptying the cache of the proxy. Click on the button below to do this.
de_de: Wir empfehlen, den Cache des Proxys zu leeren. Klicke auf den Button unten, um dies zu tun.

source: The proxy state has been changed.
de_de: Der Proxy-Status wurde geändert.

source: If this option is enabled the file preview in directory listings will not be used. This might increase the loading speed of directory listings.
de_de: Wenn diese Option aktiviert ist, wird die Dateivorschau in Verzeichnislisten nicht verwendet. Dies kann die Ladegeschwindigkeit der Verzeichnislisten erhöhen.

source: Disable file preview in directory listings
de_de: Dateivorschau in Verzeichnisauflistungen deaktivieren

source: Choose file from local server directory
de_de: Datei aus dem lokalen Serververzeichnis auswählen

source: Local server directory
de_de: Lokales Speicherverzeichnis:

source: Server-IP or -name (starting with ftp:// or ftps://)
de_de: Server-IP oder -name (beginnend mit ftp:// oder ftps://)

source: Show directory
de_de: Verzeichnis anzeigen

source: Save this credentials in directory archive
de_de: Speichere diese Anmeldeinformationen im Verzeichnis-Archiv

source: Channel-ID
de_de: Kanal-ID

source: Enter your credentials
de_de: Gibt deine Anmeldedaten ein

source: Use this file
de_de: Verwende diese Datei

source: Path to the ZIP-file
de_de: Pfad zur ZIP-Datei

source: Enter the path to a ZIP file on your hosting. Must start with "file://%1$s" and end with ".zip".
de_de: Gib den Pfad zu einer ZIP-Datei auf deinem Hosting ein. Muss mit "file://%1$s" beginnen und mit ".zip" enden.

source: Enter the path to a ZIP-file
de_de: Gibt den Pfad zu einer ZIP-Datei ein

source: Type could not be loaded!
de_de: Typ konnte nicht geladen werden!

source: Connect
de_de: Verbinden

source: Type
de_de: Typ

# taxonomy singular name
source: Directory Archive
de_de: Verzeichnisarchiv

# taxonomy general name
source: Directory Archives
de_de: Verzeichnisarchive

source: Open now
de_de: Jetzt öffnen

source: Incorrect response received from the server, possibly a server-side error.
de_de: Falsche Antwort vom Server erhalten, möglicherweise ein serverseitiger Fehler.

source: Loaded an empty directory. This could also mean that the files in the directory cannot be imported into WordPress, e.g. because they have a non-approved file type.
de_de: Es wurde ein leeres Verzeichnis geladen. Dies kann auch bedeuten, dass die Dateien im Verzeichnis nicht in WordPress importiert werden können, z. B. weil sie einen nicht zugelassenen Dateityp haben.

source: Secure token for Directory Listing missing!
de_de: Sicheres Token für Verzeichnisauflistung fehlt!

source: Configuration for Directory Listing missing!
de_de: Konfiguration für Verzeichnisauflistung fehlt!

source: Size
de_de: Größe

source: Filename
de_de: Dateiname

source: Actions
de_de: Aktionen

source: Import this directory
de_de: Importiere aktuelles Verzeichnis

source: Reload
de_de: Neu laden
